src/main/resources/xml/accommodationSalesComponentServicePort/overrideAccommodationRates/overrideAccommodationRates.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:overrideAccommodationRates>
         <!--Optional:-->
         <request>
            <!--Optional:-->
            <travelPlanSegmentId>?</travelPlanSegmentId>
            <!--Optional:-->
            <travelComponentGroupingId>?</travelComponentGroupingId>
            <!--Optional:-->
            <externalReferenceDetail>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </externalReferenceDetail>
            <!--Optional:-->
            <sourceExternalReferenceDetail>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </sourceExternalReferenceDetail>
            <!--Optional:-->
            <additionalAdultChargesOverridden>?</additionalAdultChargesOverridden>
            <!--1 or more repetitions:-->
            <rateDetails>
               <additionalCharge>?</additionalCharge>
               <additionalChargeOverridden>?</additionalChargeOverridden>
               <basePrice>?</basePrice>
               <!--Optional:-->
               <date>?</date>
               <dayCount>?</dayCount>
               <overidden>?</overidden>
               <shared>?</shared>
               <!--Optional:-->
               <rackRate>
                  <!--Optional:-->
                  <date>?</date>
                  <rate>?</rate>
               </rackRate>
               <netPrice>?</netPrice>
               <pointsValue>?</pointsValue>
            </rateDetails>
            <!--1 or more repetitions:-->
            <sharedLinks>
               <id>?</id>
               <!--Optional:-->
               <date>?</date>
            </sharedLinks>
            <!--Optional:-->
            <overrideReason>?</overrideReason>
            <!--Optional:-->
            <contactName>?</contactName>
            <!--Optional:-->
            <overrideRate>?</overrideRate>
            <locationId>?</locationId>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ejb:overrideAccommodationRates>
   </soapenv:Body>
</soapenv:Envelope>
